/**
 * Created by jiminze on 2017/9/1.
 */


//常见问题、


import React from 'react';
import propType from 'prop-types';
import '../progress/progress.scss';


export default class UrlFrameNext extends React.Component{
    constructor(){
        super();
        this.state = {

        }
    }

    render(){

        const arr = [
            {
                "Q":"来不及录入系统就被客户拿走机器，怎么办？",
                "A":"请在客户拿走机器前务必拍照留底，店铺不忙的时候尽快上传至系统中；SN码要在手表插卡激活后的48小时内录入，超过激活后48小时无法上报。"
            },
            {
                "Q":"扫码后提示此台机器SN码验证有误是怎么回事？",
                "A":"在您扫码时，扫码框中还有其他条形码同时提交会出现此提示。建议您在扫码时挡住干扰码，保证扫码框中仅有设备SN条形码或者二维码。扫码识别不出时支持手工输入SN码，请确认手工录入的SN码和拍摄照片一致。"
            },
            {
                "Q":"扫码后提示此台机器已经销售或激活是怎么回事？",
                "A":"在您销售此台糖猫之前，糖猫已经被他人销售过或激活过，已经销售或激活的糖猫不能获得销售奖励。如有疑问请您与店铺负责人联系。"
            },
            {
                "Q":"录入SN码后不可立即提现？",
                "A":"奖励分为销售奖励和激活奖励两部分，在公众号录入后立即获得销售奖励，该部分奖励暂时处于冻结状态；待录入时起21日内顾客插卡激活手表，系统后台会自动检测并更新数据，可再获得激活奖励，并体现在可申请奖励中。此奖励金额可随时申请提现。"
            },
            {
                "Q":"我刚售卖的糖猫明明已经在柜台激活了，为什么系统中还显示未激活呢？",
                "A":"激活数据每天6:00开始计算，计算周期为上一日00:00-24:00，故激活数据要在次日才能看到。如果当天在柜台激活但当天又解绑了，次日再看还是未激活状态。"
            },
            {
                "Q":"提现发放时间是什么时候，如何到账？",
                "A":"每笔奖励申请在审核通过后，每周三将以微信红包形式发出，领取后存入您的微信钱包；销售奖励的提现可以随时进行，集中审核发放；本周三之后审核通过的提现申请，将在下周三发放；每笔提现发放后红包在7个工作日内到账。"
            },
            {
                "Q":"红包未领取被退回怎么办？",
                "A":"请在24小时内领取微信红包，未领取将会退回您的账户，可重新提现。"
            },
            {
                "Q":"提示售卖的糖猫没有奖励是怎么回事？",
                "A":"搜狗糖猫之家的销售奖励仅针对线下销售渠道和特定产品系列，电商渠道不在奖励之内。如有疑问请您与店铺负责人联系。"
            },
            {
                "Q":"手太快选错了店铺怎么办？",
                "A":"更换店铺模块稍后上线。"
            },
            {
                "Q":"遇到的问题均不在以上范围，怎么办？",
                "A":"请您描述遇到的问题在搜狗糖猫之家微信服务号中发送，我们的客服人员将及时回复消息或者电话与您联系。"
            },
        ];

        const child = arr.map((obj,index)=>(
            <div className="show-problem-list">
                <p><span className="show-problem-list-title">{`Q${index+1} : `}</span><span>{obj.Q}</span></p>
                <p><span className="show-problem-list-title">{`A${index+1} : `}</span><span>{obj.A}</span></p>
            </div>
        ))

        return (

            <div className="show-problem show-problem-next">
                {/*<div className="tip-msg">*/}
                {/*进度模块还在努力建设中，请先浏览应用其他模块～～～～*/}
                {/*</div>*/}
                {child}
            </div>

        )
    }
}
